#language: ru

@tree

Функционал: проверка документа Продажи товара под Продавцом

Как Продавец я хочу
проверить создание документа Продажа
чтобы избежать ошибок в рабочей базе

Контекст: 
	Дано Я открыл сеанс TestClient от имени "Продавец" с паролем "" или подключаю уже существующий
	
Сценарий: проверка документа Продажи товара
* Открытие списка документов
	И я закрываю все окна клиентского приложения
	И я перехожу по навигационной ссылке "e1cib/list/Документ.РасходТовара"
* Создание нового документа и заполнение шапки
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "Все для дома"'
	И я нажимаю кнопку выбора у поля с именем "Покупатель"
	И я нажимаю на кнопку с именем 'ФормаИерархическийСписок'
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000002' | 'Покупатели'   |
	И в таблице "Список" я выбираю текущую строку
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'              |
		| '000000014' | 'Магазин "Бытовая техника"' |
	И в таблице "Список" я выбираю текущую строку
	Тогда элемент формы с именем "Покупатель" стал равен 'Магазин "Бытовая техника"'
	И элемент формы с именем 'ВидЦен' стал равен 'Мелкооптовая'	
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Большой'
	Тогда элемент формы с именем "Склад" стал равен 'Большой'	
	И из выпадающего списка с именем "Валюта" я выбираю точное значение 'Рубли'
	Тогда элемент формы с именем "Валюта" стал равен 'Рубли'
* Работа с табличной частью
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	И я нажимаю на кнопку с именем 'ФормаИерархическийСписок'
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000001' | 'Обувь'        |
	И в таблице "Список" я выбираю текущую строку
	И в таблице "Список" я перехожу к строке:
		| 'Артикул'  | 'Код'       | 'Наименование' |
		| 'ОБ-00100' | '000000020' | 'Валенки'      |
	И в таблице "Список" я выбираю текущую строку
* Проверка заполнения табличной части
	Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'   | 'Цена'     | 'Количество' | 'Сумма'    |
		| '1' | 'Валенки' | '1 900,00' | '1,00'       | '1 900,00' |
* Проверка итогов
	И элемент формы с именем 'ТоварыИтогКоличество' стал равен '1'
	И элемент формы с именем 'ТоварыИтогСумма' стал равен '1 900'
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
* Номер
	И я запоминаю значение поля "Номер" как "$Номер$"		
* Проведение документа	
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
* Проверка создания
	И таблица "Список" содержит строки:
		| 'Номер'   |
		| '$Номер$' |
* Пометка на удаление созданного дкумента	
		И в таблице "Список" я перехожу к строке:
		| 'Номер'   |
		| '$Номер$' |
	И я нажимаю на кнопку с именем 'ФормаУстановитьПометкуУдаления'
	Тогда открылось окно '1С:Предприятие'
	И я нажимаю на кнопку с именем 'Button0'
	И я закрываю все окна клиентского приложения

Сценарий: проверка видимости документа Заказ
* Открытие списка документов
	И я закрываю все окна клиентского приложения
	И я перехожу по навигационной ссылке "e1cib/list/Документ.Заказ"
* Проверка доступности кнопок в списке
	И элемент формы с именем "ФормаСоздать" отсутствует на форме
	И элемент формы с именем "ФормаСкопировать" отсутствует на форме
	И элемент формы с именем "ФормаПровести" отсутствует на форме
	И элемент формы с именем "ФормаОтменаПроведения" отсутствует на форме
	И в таблице "Список" я перехожу к последней строке
	И в таблице "Список" я выбираю текущую строку
* Проверка доступности кнопок в документе
	И элемент формы с именем "ФормаСоздать" отсутствует на форме
	И элемент формы с именем "ФормаСкопировать" отсутствует на форме
	И элемент формы с именем "ФормаПровести" отсутствует на форме
	И элемент формы с именем "ФормаОтменаПроведения" отсутствует на форме
//	И элемент формы с именем "ФормаЗаписать" не доступен
//  Кнопка на форме есть, но она недоступна для нажатия, не смогла придумать как ее проверить. Строка выше падает, говорит, чтого элемент доступен. Прошу подсказать как в этом случае проверить?
	И я закрываю все окна клиентского приложения
	И я закрываю сеанс текущего клиента тестирования
	
