#language: ru
@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: проверка документа Заказ

Как Тестировщик я хочу
убедиться, что документ Заказ заполняется верно 
чтобы не возникло ошибок в проде

Контекст:
Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: заполнение шапки Заказа

* Открываю форму создания документа Заказ
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
	Тогда открылось окно 'Заказы товаров'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Заказ (создание)'
* Заполнение шапки документа	
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "1000 мелочей"'
	И я нажимаю кнопку выбора у поля с именем "Покупатель"
	Тогда открылось окно 'Контрагенты'
	И в таблице "Список" я разворачиваю текущую строку
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'    |
		| '000000007' | 'Попов Б.В. ИЧП ' |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Заказ (создание) *'
	И элемент формы 'Вид цен' стал равен 'Мелкооптовая'
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Большой'
	Тогда элемент формы 'Склад' стал равен 'Большой'
	И элемент формы с именем 'СостояниеЗаказа' стал равен 'Открыт'
* Изменение покупателя и проверка заполнения вида цен
	И из выпадающего списка с именем "Покупатель" я выбираю точное значение 'Шлюзовая ООО'
	Тогда элемент формы 'Вид цен' стал равен 'Оптовая'
* Изменение организации и проверка новых полей
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "Товары"'
    Тогда элемент формы с именем 'Валюта' доступен
	И из выпадающего списка с именем "Валюта" я выбираю точное значение 'Рубли'
	Тогда элемент формы 'Валюта взаиморасчетов' стал равен 'Рубли'
* Изменение склада и проверка значения
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Средний'
	Тогда элемент формы 'Склад' стал равен 'Средний'
* Изменение состояния заказа и проверка значения	
	И я меняю значение переключателя с именем 'СостояниеЗаказа' на 'В работе'
	Тогда элемент формы с именем 'СостояниеЗаказа' стал равен 'В работе'
	И я закрываю все окна клиентского приложения
	
Сценарий: проверка заполнения поля Количество (итог)

* Открываю форму создания документа Заказ
	И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
	Тогда открылось окно 'Заказы товаров'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Заказ (создание)'
* Заполнение покупателя и вида цен
	И из выпадающего списка с именем "Покупатель" я выбираю точное значение 'Шлюзовая ООО'
	Тогда элемент формы 'Вид цен' стал равен 'Оптовая'
* Заполнение табличной части
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	Тогда открылось окно 'Товары'
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование'  |
		| '000000012' | 'Электротовары' |
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование' |
		| '000000039' | 'Телевизоры'   |
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000040' | 'Sony К3456P'  |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Заказ (создание) *'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Sony К3456P'
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Доставка'
* Проверка заполнения табличной части
	Тогда таблица "Товары" стала равной:
		| 'Товар'       | 'Цена'     | 'Количество' | 'Сумма'    |
		| 'Sony К3456P' | '5 500,00' | '1'          | '5 500,00' |
		| 'Доставка'    | '200,00'   | ''           | '200,00'   |
* Проверка Итогов		
	И элемент формы с именем 'ТоварыИтогКоличество' стал равен '2'
	И элемент формы с именем 'ТоварыИтогСумма' стал равен '5 700'
* Изменение количества
	И в таблице 'Товары' я перехожу к первой строке
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '2'
	И в таблице "Товары" я завершаю редактирование строки
* Проверка Итогов после изменения количества
	И элемент формы с именем 'ТоварыИтогКоличество' стал равен '3'
	И элемент формы с именем 'ТоварыИтогСумма' стал равен '11 200'
	И я закрываю все окна клиентского приложения

