#language: ru
@ExportScenarios
@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект> 

Контекст:
Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Заполнение шапки Заказа

* Открываю форму создания документа Заказ
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
	Тогда открылось окно 'Заказы товаров'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Заказ (создание)'
* Заполнение шапки документа	
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "1000 мелочей"'
	И я нажимаю кнопку выбора у поля с именем "Покупатель"
	Тогда открылось окно 'Контрагенты'
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование'    |
		| '000000002' | 'Покупатели' |
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'    |
		| '000000007' | 'Попов Б.В. ИЧП ' |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Заказ (создание) *'
	И элемент формы 'Вид цен' стал равен 'Мелкооптовая'
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Большой'
	Тогда элемент формы 'Склад' стал равен 'Большой'
	И элемент формы с именем 'СостояниеЗаказа' стал равен 'Открыт'
* Изменение покупателя и проверка заполнения вида цен
	И я нажимаю кнопку выбора у поля с именем "Покупатель"
	Тогда открылось окно 'Контрагенты'
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование'    |
		| '000000002' | 'Покупатели' |
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'    |
		| '000000004' | 'Шлюзовая ООО' |
	И в таблице "Список" я выбираю текущую строку
	Тогда элемент формы 'Вид цен' стал равен 'Оптовая'
* Изменение организации и проверка новых полей
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "Товары"'
    Тогда элемент формы с именем 'Валюта' доступен
	И из выпадающего списка с именем "Валюта" я выбираю точное значение 'Рубли'
	Тогда элемент формы 'Валюта взаиморасчетов' стал равен 'Рубли'
* Изменение склада и проверка значения
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Средний'
	Тогда элемент формы 'Склад' стал равен 'Средний'
* Изменение состояния заказа и проверка значения	
	И я меняю значение переключателя с именем 'СостояниеЗаказа' на 'В работе'
	Тогда элемент формы с именем 'СостояниеЗаказа' стал равен 'В работе'
* Заполнение табличной части
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	Тогда открылось окно 'Товары'
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование'  |
		| '000000012' | 'Электротовары' |
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование' |
		| '000000039' | 'Телевизоры'   |
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000040' | 'Sony К3456P'  |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Заказ (создание) *'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Sony К3456P'
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Доставка'
* Проверка заполнения табличной части
	Тогда таблица "Товары" стала равной:
		| 'Товар'       | 'Цена'     | 'Количество' | 'Сумма'    |
		| 'Sony К3456P' | '5 500,00' | '1'          | '5 500,00' |
		| 'Доставка'    | '200,00'   | ''           | '200,00'   |
И элемент формы с именем 'ТоварыИтогКоличество' стал равен '2'
И элемент формы с именем 'ТоварыИтогСумма' стал равен '5 700'
И я нажимаю на кнопку "Записать"	
* Номер
И я запоминаю значение поля "Номер" как "$$перемНомер$$"	
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна 'Заказ (создание) *' в течение 20 секунд
Тогда открылось окно 'Заказы товаров'

Сценарий: Проверка заполнения поля Количество (итог)
И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
Когда открылось окно 'Заказы товаров'
И в таблице "Список" я перехожу к строке:
		| 'Номер'   |
		| '$$перемНомер$$' |
И в таблице "Список" я выбираю текущую строку
И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '2'
И в таблице "Товары" я завершаю редактирование строки
И элемент формы с именем 'ТоварыИтогКоличество' стал равен '3'
И элемент формы с именем 'ТоварыИтогСумма' стал равен '11 200'
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна 'Заказ * от * *' в течение 20 секунд
И я удаляю переменную "$$перемНомер$$"
И я закрываю все окна клиентского приложения



		







