#language: ru

@tree

Функционал: заказ покупателя

Как Тестировщик я хочу
заполнить поля в Заказе покупателю
чтобы убедиться что все поля заполняются верно и нет ошибок

Контекст: 
	Дано Я открыл новый сеанс TestClient или подключил уже существующий
	
Сценарий: проверка заполнения полей в Заказе покупателя
* Открытие документа
	И я закрываю все окна клиентского приложения
	Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesOrder"
	И я нажимаю на кнопку с именем 'FormCreate'
* Заполнение и проверка полей
	И я нажимаю кнопку выбора у поля с именем "Partner"
	И в таблице "List" я перехожу к строке:
		| 'Наименование'            |
		| 'Клиент 1 (1 соглашение)' |
	И в таблице "List" я выбираю текущую строку
	И элемент формы с именем "Partner" стал равен 'Клиент 1 (1 соглашение)'
	И элемент формы с именем "Agreement" стал равен 'Соглашение с клиентами (расчет по документам + кредитный лимит)'
	И элемент формы с именем "LegalName" стал равен 'Клиент 1'
* Изменение партнера
	И я нажимаю кнопку выбора у поля с именем "Partner"
	Тогда открылось окно 'Партнеры'
	И в таблице "List" я перехожу к строке:
		| 'Наименование'       |
		| 'Розничный покупатель' |
	И в таблице "List" я выбираю текущую строку
	Тогда открылось окно 'Табличная часть товаров будет обновлена'
	И я нажимаю на кнопку с именем 'FormOK'
*  Проверка перезаполнения полей 
	И элемент формы с именем "Partner" стал равен 'Розничный покупатель'
	И элемент формы с именем "Agreement" стал равен 'Розничное'
	И элемент формы с именем "LegalName" стал равен 'Розничный покупатель'	
* Удаление значения из поля партнер
	И в поле с именем 'Partner' я ввожу текст ''
* Проверка недоступности поля Контрагент
	Тогда элемент формы с именем 'LegalName' не доступен
	И я закрываю все окна клиентского приложения
	


			
		