#language: ru

@tree

Функционал: заполнение документа Заказ покупателя

Как Тестировщик я хочу
проверить автозаполнение поля Организация в документе Заказ покупателя
чтобы у пользователя не возникало ошибки с пустым полем

Контекст: 
	Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: заполнение поля Организация в документе Заказ покупателя
	И я закрываю все окна клиентского приложения
	Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesOrder"
	И я нажимаю на кнопку с именем 'FormCreate'
	И я нажимаю кнопку выбора у поля с именем "Agreement"
	И в таблице "List" я перехожу к строке:
		| 'Код' | 'Наименование'                                                    | 'Вид'     | 'Вид взаиморасчетов' |
		| '1'   | 'Соглашение с клиентами (расчет по документам + кредитный лимит)' | 'Обычное' | 'По документам'      |
	И в таблице "List" я выбираю текущую строку
	Если элемент формы с именем "Company" стал равен "Собственная компания 1" Тогда
		И я закрываю все окна клиентского приложения
	Иначе 
		И я нажимаю кнопку выбора у поля с именем "Company"
		И в таблице "List" я перехожу к строке:
			| 'Код' | 'Наименование'           |
			| '1'   | 'Собственная компания 1' |
		И в таблице "List" я выбираю текущую строку
	И я закрываю все окна клиентского приложения
		
		

		