#language: ru

@tree

Функционал: добавление услуги в документ Заказ

Как Тестировщик я хочу
проверить что поле количество доступно для заполнения 

Контекст:
Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: проверка доступности заполнения количества для услуги в заказе
* Подбор документа
И я закрываю все окна клиентского приложения
И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
Когда открылось окно 'Заказы товаров'
И в таблице "Список" я перехожу к строке:
	| 'Дата'                | 'Номер'     |
	| '21.12.2020 23:29:22' | '000000020' |
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Заказ * от *'
* Добавление услуги
И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
Тогда открылось окно 'Товары'
И в таблице "Список" я разворачиваю строку:
	| 'Код'       | 'Наименование' |
	| '000000036' | 'Услуги'       |
И в таблице "Список" я перехожу к строке:
	| 'Код'       | 'Наименование' |
	| '000000037' | 'Доставка'     |
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Заказ * от * *'
И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Доставка'
И в таблице "Товары" я завершаю редактирование строки
* Установка количества
И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '1,00'
И Я закрываю текущее окно
И открылось окно "1С:Предприятие"
И я нажимаю на кнопку с именем "Button0"


