#language: ru

@tree

Функционал: проверка расчета суммы документа Заказ

Как Тестировщик я хочу
убедиться, что сумма заказа расчитывается верно после изменения цены и количества

Контекст:
Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: проверка расчета суммы документа Заказ
* Подбор документа
И я закрываю все окна клиентского приложения
И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
Когда открылось окно 'Заказы товаров'
И в таблице "Список" я перехожу к строке:
	| 'Дата'                | 'Номер'     |
	| '21.12.2020 18:43:00' | '000000018' |
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Заказ * от *'
* Проверка табличной части Товары
Тогда таблица "Товары" содержит строки:
	| 'Товар'   | 'Цена'  | 'Количество' | 'Сумма'    |
	| 'Йогурт'  | '40,00' | '100'        | '4 000,00' |
	| 'Ряженка' | '55,00' | '50'         | '2 750,00' |
И элемент формы с именем "ТоварыИтогСумма" стал равен "6 750"
* Изменение цены и количества
И в таблице 'Товары' я перехожу к первой строке
И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '250,00'
И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '30,00'
И в таблице "Товары" я завершаю редактирование строки
И в таблице "Товары" я перехожу к следующей строке
И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '30'
И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '75,00'
И в таблице "Товары" я завершаю редактирование строки
* Запоминаем в переменные цену, количество и считаем сумму
И в таблице 'Товары' я перехожу к первой строке
И я запоминаю значение таблицы "Товары" поля "Цена" как "$Цена1$"
И я запоминаю значение таблицы "Товары" поля "Количество" как "$Количество1$"
И я запоминаю значение выражения 'Формат($Цена1$*$Количество1$,"ЧДЦ=2")' в переменную "$Сумма1$"
И в таблице 'Товары' я перехожу к следующей строке
И я запоминаю значение таблицы "Товары" поля "Цена" как "$Цена2$"
И я запоминаю значение таблицы "Товары" поля "Количество" как "$Количество2$"
И я запоминаю значение выражения 'Формат($Цена2$*$Количество2$,"ЧДЦ=2")' в переменную "$Сумма2$"
Тогда таблица "Товары" стала равной:
	| 'Товар'   | 'Цена'  | 'Количество' | 'Сумма'    |
	| 'Йогурт'  | "$Цена1$" | "$Количество1$"       | "$Сумма1$" |
	| 'Ряженка' | "$Цена2$" | "$Количество2$"       | "$Сумма2$" |
И я запоминаю значение выражения 'Формат(Число($Сумма1$)+Число($Сумма2$))' в переменную "$СуммаИтого$"
* Сравниваем суммы
И элемент формы с именем "ТоварыИтогСумма" стал равен "$СуммаИтого$"
И я закрываю текущее окно
И открылось окно "1С:Предприятие"
И я нажимаю на кнопку с именем "Button1"